1. MVVM (Model - View - ViewModel)
    마크업 언어나 GUI 코드를 비즈니스 로직 또는 백엔드 로직과 분리하여 개발하는
    소프트웨어 디자인 패턴

2. 뷰는 컴포넌트(Component) 기반 프레임워크
    코드 가독성, 재사용성 증가

3. 앵귤러의 양방향 데이터 바인딩과 리액트의 단방향 데이터 흐름의 장점을 결합한 프레임워크
 - 양방향 데이터 바인딩
   화면에 표시되는 값과 프레임워크의 모델 데이터 값이 동기화되어 한쪽이 변경되면
   다른 한쪽도 자동으로 변경되는 것을 말한다.

 - 단방향 데이터 흐름
   컴포넌트의 단방향 통신, 컴포넌트 간에 데이터를 전달할 때 항상 상위 컴포넌트에서
   하위 컴포넌트 한 방향으로만 전달하게 구조화 되어있는 것

 - 가상 돔
   빠른 화면 렌더링을 위해서 리액트의 가상 돔 방식을 적용하여 사용자 인터랙션이 많은
   요즘 웹 화면에 적합한 동작 구조를 갖추고 있다. 화면 전체를 다시 그리지 않고 프레임워크
   에서 정의한 방식에 따라 화면을 갱신한다. -> 성능 부하 감소

